/************************************************************
*模块名称:指示灯驱动模块
*文件名  :LED.h
*说明    :头文件，提供用户自定义数据类型以及供外部调用的接口函数声明
*版本号  :V1.0
*修改记录:
*************************************************************/
#ifndef __LED_H
#define __LED_H
/************************************************************
									本模块包含的头文件
************************************************************/
#include"stm32f4xx_hal.h"
/************************************************************
									本模块自定义数据类型
************************************************************/
//定义指示灯编号数据类型，采用枚举类型实现
typedef enum 
{
	LED0 = 0,
	LED1 = 1,
	LED2 = 2,
	LED3 = 3,
	LED4 = 4,
	LED5 = 5,
	LED6 = 6,
	LED7 = 7,
}LED_INDEX;
//定义指示灯驱动方式数据类型，采用枚举类型实现
typedef enum
{
	LOW_LEVEL ,   //低电平驱动
	HIGH_LEVEL    //高电平驱动
}LED_DRIVE;
/************************************************************
									本模块提供给外部调用的函数
************************************************************/
//指示灯配置函数
extern void BSP_LED_Config( LED_INDEX num, GPIO_TypeDef* port, uint16_t pin, LED_DRIVE level);
extern void BSP_LED_On(LED_INDEX num);
extern void BSP_LED_Off(LED_INDEX num);
extern void BSP_LED_Toggle(LED_INDEX num);
#endif